jmeter/et-grpc-login-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">32</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="et-upload-test">
          <stringProp name="GRPCSampler.protoFolder">/Users/qobiljon/Desktop/et-scalability-test/et-grpc-server/et_protos</stringProp>
          <stringProp name="GRPCSampler.host">4.230.148.47</stringProp>
          <stringProp name="GRPCSampler.port">50051</stringProp>
          <stringProp name="GRPCSampler.fullMethod">ETService/submitDataRecord</stringProp>
          <stringProp name="GRPCSampler.deadline">9999</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">true</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">99999</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">999999999</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;userId&quot;: ${userId},
	&quot;sessionKey&quot;: ${sessionKey},
	&quot;campaignId&quot;: ${campaignId},
	&quot;timestamp&quot;: ${timestamp},
	&quot;dataSource&quot;: ${dataSource},
	&quot;accuracy&quot;: ${accuracy},
	&quot;value&quot;: ${value}
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor">
            <stringProp name="scriptLanguage">javascript</stringProp>
            <stringProp name="filename">/Users/qobiljon/Desktop/jmeter/submit_data_preprocessor.js</stringProp>
            <stringProp name="cacheKey">true</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>